<?php
header('Content-Type: text/html; charset=utf-8');
require_once "functions.php";

////Задание 1
echo "<p>--------------------Задание 1-----------------</p>";
$array[1]="Элемент 1";
$array[2]="Элемент 2";
$array[3]="Элемент 3";

echo task1($array, true);

////Задание 2
echo "<p>---------------------Задание 2-----------------</p>";

echo task2('/', 12, 3);

////Задание 3
echo "<p>---------------------Задание 3-----------------</p>";

task3(7,5);

////Задание 4
echo "<p>---------------------Задание 4-----------------</p>";
task4('24.02.2016 00:00:00');

////Задание 5
echo "<p>---------------------Задание 5-----------------</p>";
task5('Карл у Клары украл Кораллы', 'Две бутылки лимонада');

////Задание 6
echo "<p>---------------------Задание 6-----------------</p>";
file_put_contents('text.txt', 'Hello again!', FILE_APPEND);
task6('text.txt');
